SacredDarkKing/STM32_Bare-Metal_Development_Tutorial/2.3-PWM驱动LED呼吸灯/Hardware/LED.c
#include "stm32f10x.h"                  // Device header

void LED_Init(void) 
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStruct;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStruct);
	
	GPIO_SetBits(GPIOA, GPIO_Pin_2 | GPIO_Pin_3);
}

void LED2_On(void)
{
	GPIO_ResetBits(GPIOA, GPIO_Pin_2);
}

void LED2_Off(void)
{
	GPIO_SetBits(GPIOA, GPIO_Pin_2);
}

void LED2_Turn(void)
{
	if (GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_2) == 0)
	{
		GPIO_SetBits(GPIOA, GPIO_Pin_2);
	} else 
	{
		GPIO_ResetBits(GPIOA, GPIO_Pin_2);
	}
	
}

void LED3_On(void)
{
	GPIO_ResetBits(GPIOA, GPIO_Pin_3);
}

void LED3_Off(void)
{
	GPIO_SetBits(GPIOA, GPIO_Pin_3);
}

void LED3_Turn(void)
{
	if (GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_3) == 0)
	{
		GPIO_SetBits(GPIOA, GPIO_Pin_3);
	} else 
	{
		GPIO_ResetBits(GPIOA, GPIO_Pin_3);
	}
	
}
